import pytest

from PublicReference.calc_core import *
from PublicReference.装备 import 装备列表


class TestCalcCore:
    def test_get_specify_counts_weapon(self):
        有效智慧产物 = [['衣服1', '衣服2', '衣服3'], ['头肩1', '头肩2', '头肩3'], ['下装1', '下装2', '下装3']]
        挑选数量 = 2
        已挑选装备 = []
        装备组合 = 获取指定数量的智慧产物组合(有效智慧产物, 挑选数量, 已挑选装备)
        print(装备组合)
        assert len(装备组合) == 54  # A(3,2)*3*3

    def test_get_specify_counts_weapon(self):
        有效智慧产物 = [['衣服1', '衣服2', '衣服3'], ['头肩1', '头肩2', '头肩3'], ['下装1', '下装2', '下装3']]
        挑选数量 = 2
        已挑选装备 = []
        装备组合 = 获取指定数量的智慧产物组合_V2(有效智慧产物, 挑选数量, 已挑选装备, 0)
        print(装备组合)
        assert len(装备组合) == 27  # C(3,2)*3*3

    def test_calc_set_effect_count(self):
        test_set = ['噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '幸运三角', '幸运三角',
                    '幸运三角', '军神的隐秘遗产', '军神的隐秘遗产', '军神的隐秘遗产']
        set_effect = 计算套装效果(test_set)
        assert set_effect.get('噩梦：地狱之路') == 5
        assert set_effect.get('幸运三角') == 3
        assert set_effect.get('军神的隐秘遗产') == 3

    def test_calc_smart_set(self):
        有效部位列表 = [['撒旦：沸腾之怒', '奔流不息之岁月', '英明循环之生命', '无念之仪服'], ['贝利亚尔：毁灭之种', '奔流不息之山川', '完美掌控', '无欲之花'],
                  ['亚蒙：谎言之力', '奔流不息之伽蓝', '无形之气韵'], ['亚巴顿：绝望地狱', '奔流不息之狂风', '无我之轮回'], ['巴尔：堕落之魂', '奔流不息之银河', '无言之罪恶'],
                  ['白象之庇护', '噙毒手套'], ['四叶草之初心', '先知者的预言'], ['红兔之祝福', '骸麒之戒'], ['军神的古怪耳环', '军神的心之所念', '窥视未来耳环'],
                  ['军神的遗书', '青面修罗的面具'], ['军神的庇护宝石', '赤鬼的次元石'], ['激光流星弓']]
        套装组合 = [['噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '噩梦：地狱之路', '幸运三角', '幸运三角',
                 '幸运三角', '军神的隐秘遗产', '军神的隐秘遗产', '军神的隐秘遗产'],
                ['永恒不息之路', '永恒不息之路', '永恒不息之路', '永恒不息之路', '永恒不息之路', '幸运三角', '幸运三角', '幸运三角',
                 '军神的隐秘遗产', '军神的隐秘遗产', '军神的隐秘遗产']]
        包含智慧产物套装组合, 包含智慧产物的套装效果 = 计算智慧产物套装组合(套装组合, 有效部位列表, 1, 装备列表)
        assert len(包含智慧产物套装组合) == 24
